Revit 2024 API
RebarShapeConstraintSagittaLength Class
 A constraint that can be applied to a RebarShapeDefinitionByArc and drives the height of the arc.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class RebarShapeConstraintSagittaLength : RebarShapeConstraint
Visual Basic
Public Class RebarShapeConstraintSagittaLength _
	Inherits RebarShapeConstraint
Visual C++
public ref class RebarShapeConstraintSagittaLength : public RebarShapeConstraint
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraintSagittaLength
See Also
RebarShapeConstraintSagittaLength Members
Autodesk.Revit.DB.Structure Namespace